Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыСУЗ/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ОписаниеДопустимыхТиповПеретаскивания; // Типы, которые можно перетащить в ресурс

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Доступность вкладок и настроек
	
	Если ЗначениеЗаполнено(Объект.ИдентичныйРесурс) Тогда
		Элементы.ГруппаФайлы.Видимость = Ложь;
		Элементы.ГруппаЗависимыеРесурсы.Видимость = Ложь;
	Иначе
		Элементы.ГруппаФайлы.Видимость = Истина;
		Элементы.ГруппаЗависимыеРесурсы.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаНастройкиИнтерактивногоРесурса.Видимость = Объект.Интерактивный;
	
	Элементы.SCO.Доступность           = НЕ Объект.Интерактивный;
	Элементы.Интерактивный.Доступность = НЕ Объект.SCO;
	
	Если Объект.Интерактивный Тогда
		Объект.SCO = Ложь;
	КонецЕсли;
	
	Если Объект.SCO Тогда
		Объект.Интерактивный = Ложь;
	КонецЕсли;
	
	Если Объект.Интерактивный И ЗначениеЗаполнено(Объект.ИдентичныйРесурс) Тогда
		Элементы.НастройкиИнтерактивногоРесурса.ИзменятьСоставСтрок = Ложь;
	КонецЕсли;
	
	// Отборы
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ФайлыРесурса, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЗависимыеРесурсы, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(НастройкиИнтерактивногоРесурса, ?(ЗначениеЗаполнено(Объект.ИдентичныйРесурс), Объект.ИдентичныйРесурс, Объект.Ссылка));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Определяем родителя ресурса
	
	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	Подборка          = Параметры.Подборка;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	ЭлементПодборки   = Параметры.ЭлементПодборки;
	
	РазработкаСУЗ.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.РесурсыСУЗ");
	
	// Устанавливаем доступность элементов формы
	
	УстановитьДоступностьЭлементовФормы();
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ФайлыРесурса;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ЗависимыеРесурсы;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Ссылки;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Ссылки, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);	
	
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
		Справочники.ЭлементыПодборкиСУЗ.Перезаписать(ЭлементПодборки);	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	Оповестить("РесурсЗаписан", Объект.Ссылка, ЭтотОбъект); // Всегда
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подборка) Тогда
		Оповестить("ПодборкаОбновлена", Подборка, ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РесурсЗаписан" И Параметр = Объект.Ссылка И Источник <> ЭтотОбъект Тогда
		Прочитать();
		Элементы.ФайлыРесурса.Обновить();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ЗагрузитьФайлы(Команда)

	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияПослеЗагрузки = Новый ОписаниеОповещения("ПослеЗагрузкиФайлов", ЭтотОбъект);
	
	РазработкаСУЗКлиент.ЗагрузитьФайлы(,,Объект.Ссылка,, Элементы.ФайлыРесурса.ТекущаяСтрока,,,ОписаниеОповещенияПослеЗагрузки);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайлов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элементы.ФайлыРесурса.Обновить();
	
	Прочитать();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФайлЗапускаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	
	Если ЗначениеЗаполнено(Объект.ИдентичныйРесурс) Тогда
		ПараметрыФормы.Вставить("Ресурс", Объект.ИдентичныйРесурс);
	Иначе
		ПараметрыФормы.Вставить("Ресурс", Объект.Ссылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФайлЗапуска) Тогда
		ПараметрыФормы.Вставить("НачальноеЗначение", Объект.ФайлЗапуска);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСтартовогоФайла", ЭтотОбъект);		
		
	ОткрытьФорму("Справочник.РесурсыСУЗ.Форма.ФормаВыбораСтартовогоФайла", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСтартовогоФайла(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) И ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		Объект.ФайлЗапуска = РезультатЗакрытия;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ИдентичныйРесурсПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИнтерактивныйПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура SCOПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Файлы

&НаКлиенте
Процедура ФайлыРесурсаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыРесурсаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФайлыРесурсаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	РазработкаСУЗКлиент.ОбработатьСобытиеПроверкаПеретаскивания(ПараметрыПеретаскивания, ОписаниеДопустимыхТиповПеретаскивания, СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ФайлыРесурсаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	РазработкаСУЗКлиент.ОбработатьСобытиеПеретаскивание(ПараметрыПеретаскивания, ОписаниеДопустимыхТиповПеретаскивания, СтандартнаяОбработка, Строка, Объект.Ссылка, Элементы.ФайлыРесурса, ЭтотОбъект);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ЗависимыеРесурсы

&НаКлиенте
Процедура ЗависимыеРесурсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеРесурсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ НастройкиИнтерактивногоРесурса

&НаКлиенте
Процедура НастройкиИнтерактивногоРесурсаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиИнтерактивногоРесурсаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка И ЗначениеЗаполнено(Объект.ИдентичныйРесурс) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ПараметрыФормы = Новый Структура("ВладелецНастроек, Ключ", Объект.Ссылка, ВыбраннаяСтрока);
		
		ОткрытьФорму("Справочник.НастройкиИнтерактивногоРесурсаСУЗ.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Ссылки

&НаКлиенте
Процедура СсылкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ОписаниеДопустимыхТиповПеретаскивания = Новый ОписаниеТипов("Файл");
